In [3]:
import pandas as pd
url = 'drinks.csv'
df = pd.read_csv(url).head(5).copy()
df

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [5]:
df

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [7]:
print type(df)
print df.shape

<class 'pandas.core.frame.DataFrame'>
(5, 6)

In [9]:
df.continent

0    AS
1    EU
2    AF
3    EU
4    AF
Name: continent, dtype: object

In [11]:
print type(df.continent)
print df.continent.shape

<class 'pandas.core.series.Series'>
(5L,)

In [13]:
df['continent']

0    AS
1    EU
2    AF
3    EU
4    AF
Name: continent, dtype: object

In [15]:
print type(df['continent'])
print df['continent'].shape

<class 'pandas.core.series.Series'>
(5L,)